Autodesk.Revit.DB.MEPCalculationServerInfo.GetMEPCalculationServerInfo(Autodesk.Revit.DB.FamilyInstance)
Gets a MEPCalculationServerInfo by family instance.
famInst:
The family instance.
Returns:
The MEPCalculationServerInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.MEPCalculationServerInfo.Description
The Description of the server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.MEPCalculationServerInfo.ServerName
The Name of the server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor(Autodesk.Revit.DB.MEPCalculationServerInfo)
Constructs a new copy of the input MEPCalculationServerInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor(Autodesk.Revit.DB.ExternalService.IExternalServer)
Create a new MEPCalculationServerInfo by an external server.
server:
The external server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null